#!/usr/bin/env python

'''Модуль с идеальным описанием модуля

В первой строке должен находиться #!/usr/bin/env python. Это позволит запускать в linux скрипты без указания интерпретатора
Дальше должна идти многострочная строка документации с описанием модуля. Многострочные строки документации состоят из однострочной строки документации с последующей пустой строкой, за которой следует более подробное описание.
'''

import sys
'''
Импорт системного модуля. Он понадобится для получении информации о системных путях Python
'''
#import figures
'''
Сначала импортируйте встроенные модули, затем сторонние и только потом — собственные.
'''
__author__ = "bigazzzz"
__copyright__ = "Copyright 2019"
__credits__ = ["Kirill", "Michael", "Alexander", "Oleg"]
__license__ = "GPL"
__version__ = "0.1"
__maintainer__ = "bigazzzz"
__email__ = "bigazzzz@gmail.com"
__status__ = "Production"

